prospringintegration_src/alternatives/openesb/JmsExample/src/jmsProvider.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="jmsProvider" targetNamespace="http://j2ee.netbeans.org/wsdl/JmsExample/jmsProvider"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:tns="http://j2ee.netbeans.org/wsdl/JmsExample/jmsProvider"
             xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types/>
  <message name="jmsProviderOperationRequest">
    <part name="part1" type="xsd:string"/>
  </message>
  <message name="jmsProviderOperationResponse">
    <part name="part1" type="xsd:string"/>
  </message>
  <portType name="jmsProviderPortType">
    <operation name="jmsProviderOperation">
      <input name="input1" message="tns:jmsProviderOperationRequest"/>
      <output name="output1" message="tns:jmsProviderOperationResponse"/>
    </operation>
  </portType>
  <binding name="jmsProviderBinding" type="tns:jmsProviderPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="jmsProviderOperation">
      <soap:operation/>
      <input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/JmsExample/jmsProvider"/>
      </input>
      <output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/JmsExample/jmsProvider"/>
      </output>
    </operation>
  </binding>
  <service name="jmsProviderService">
    <port name="jmsProviderPort" binding="tns:jmsProviderBinding">
      <soap:address location="http://localhost:${HttpDefaultPort}/jmsProviderService/jmsProviderPort"/>
    </port>
  </service>
  <plnk:partnerLinkType name="jmsProvider">
    <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes.
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
    <plnk:role name="jmsProviderPortTypeRole" portType="tns:jmsProviderPortType"/>
  </plnk:partnerLinkType>
</definitions>

