prospringintegration_src/alternatives/openesb/JmsCAP/test/TestCase1/Input.xml

<soapenv:Envelope
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:jms="http://j2ee.netbeans.org/wsdl/JmsExample/jmsProvider">
  <soapenv:Body>
    <jms:jmsProviderOperation>
      <part1>test</part1>
    </jms:jmsProviderOperation>
  </soapenv:Body>
</soapenv:Envelope>
